{
    "home": {
        "welcome": "مرحبًا بكم في شركتنا",
        "tagline": "نحن نبني المستقبل بخبرة وإبداع",
        "about_title": "من نحن",
        "about_text": "في عالم تُبنى فيه الأحلام على الأرض، نضع نحن أسس الثقة. شركتنا ليست مجرد شركة مقاولات، بل شريك حقيقي في رحلة التشييد والتميّز.  بخبرة تمتد عبر السنوات، وفرق عمل تتقن التفاصيل كما تتقن الصروح، نقدم حلول بناء متكاملة ترتقي بمعايير الجودة والابتكار.رؤيتنا لا تقتصر على إنجاز المشاريع، بل على ترك بصمة تدوم.",
        "services_title": "خدماتنا",
        "services": {
            "construction": "التشييد والبناء",
            "construction_desc": "من وضع أول حجر إلى تسليم المفاتيح، نقدم حلول تشييد متكاملة تُناسب مختلف أحجام وأنواع المشاريع. تشمل خبراتنا بناء الفلل السكنية، الأبراج التجارية، والمرافق الحكومية، مع التزام صارم بمعايير الجودة، السلامة، والكفاءة. كل مشروع نبنيه هو شهادة حقيقية على دقة التنفيذ وعمق الخبرة.",
            "management": "إدارة المشاريع",
            "management_desc": "نقدّم خدمات إدارة مشاريع متكاملة تضمن الرقابة، الشفافية، والتنفيذ ضمن الميزانية والإطار الزمني المحدد. نعتمد منهجًا دقيقًا يشمل تخطيط التكاليف، تقليل المخاطر، تنسيق الأطراف، وضمان الجودة — كل ذلك تحت إشراف فريق متخصص يتابع المشروع من الفكرة حتى التسليم.",
            "design": "التصميم الداخلي والخارجي",
            "design_desc": "فلسفتنا في التصميم تجمع بين الجمال والوظيفة والطابع الشخصي. سواء كنت تبحث عن تصميم داخلي دافئ أو واجهة خارجية مبهرة، نصمّم مساحات تعكس هويتك وتلبّي أسلوب حياتك. نستخدم أحدث الأدوات والمواد لنقدم حلولاً مبتكرة تجمع بين الإبداع والعملية.",
            "renovation": "التجديد والترميم",
            "renovation_desc": "نُجدد المساحات القديمة برؤية معاصرة تحافظ على جوهر المكان وتمنحه حياة جديدة. خدماتنا في الترميم تشمل تحسين البنية، تحديث التصاميم، وإعادة تشكيل المساحة بما يلائم العصر دون التفريط بأصالتها. سواء كان التحديث كلياً أو جزئياً، نضمن نتيجة تدمج الأصالة مع الحداثة."
        },
        "features": {
            "quality": {
                "title": "جودة لا تقبل التنازل",
                "description": "نلتزم بأعلى معايير الجودة في كل تفصيلة، من المواد المختارة بعناية إلى دقة التنفيذ. مشاريعنا ليست مجرد إنجازات، بل بصمات تَفوق تدوم لسنوات."
            },
            "commitment": {
                "title": "دقة في المواعيد، التزام في الوعود",
                "description": "نحن لا نعد بموعد، بل نلتزم به. إدارة الوقت جزء لا يتجزأ من ثقافتنا المهنية، لأننا نؤمن أن احترام وقت العميل هو أول مظاهر الاحتراف الحقيقي."
            },
            "team": {
                "title": "فريق من النخبة",
                "description": "وراء كل مشروع ناجح يقف فريق يمتلك الخبرة، الشغف، والرؤية. مهندسونا وفنّينا يتمتعون بخبرة عملية عميقة، وروح إبداعية تسعى للكمال."
            },
            "innovation": {
                "title": "حلول تتحدث بلغة المستقبل",
                "description": "نبتكر، لا نقلد. ندرس احتياجك، ونُترجمه إلى أفكار تصميمية ذكية ومتكاملة، تجمع بين العملية والجمال، وتُلبي تطلعات الغد لا فقط حاجات اليوم."
            }
        },
        "our_works": "أعمالنا",
        "contact_title": "تواصل معنا",
        "message": "اكتب رسالتك هنا...",
        "name": "الاسم",
        "phone": "رقم الهاتف",
        "map_location": "موقعنا على الخريطة",
        "why_us": "لماذا نحن؟",
        "why_us_text": "لأننا نؤمن أن كل مشروع يستحق العناية الفائقة، والخبرة الحقيقية.",
        "quality": "الجودة",
        "quality_text": "نلتزم بتقديم أعلى مستويات الجودة في كل مرحلة من مراحل المشروع.",
        "commitment": "الالتزام",
        "commitment_text": "نلتزم بتنفيذ المشاريع وفق الجداول الزمنية والميزانيات المتفق عليها.",
        "professionalism": "الاحترافية",
        "professionalism_text": "فريق عمل محترف ومدرب على أعلى المستويات لتنفيذ جميع المشاريع بأعلى كفاءة.",
        "innovation": "الابتكار",
        "innovation_text": "نقدم حلولًا مبتكرة تلبي احتياجات عملائنا وتعزز من قيمة مشاريعهم."
    },
    "nav": {
        "home": "الرئيسية",
        "about": "من نحن",
        "services": "الخدمات",
        "projects": "المشاريع",
        "contact": "اتصل بنا"
    }
}